brew "pinentry-mac"
brew "starship"
brew "fzf"
brew "gh"
brew "tree"
brew "node@24"
{{- if eq .machineType "personal" }}
brew "gpg"
brew "mas"
{{- end }}

cask "font-fira-code-nerd-font"
{{- if eq .machineType "personal" }}
cask "raycast"
cask "chatgpt"
cask "1password-cli"
cask "google-chrome"
cask "docker"
cask "docker-desktop"
cask "rectangle"
cask "iterm2"
cask "visual-studio-code"
cask "discord"
cask "spotify"
{{ end -}}

{{- if eq .machineType "personal" }}
mas "1Password", id: 1333542190
mas "Slack", id: 803453959
mas "TickTick", id: 966085870
mas "Flow", id: 1423210932
{{ end -}}

{{- if eq .machineType "personal" }}
vscode "bradlc.vscode-tailwindcss"
vscode "christian-kohler.npm-intellisense"
vscode "coderoad.coderoad"
vscode "davidanson.vscode-markdownlint"
vscode "dbaeumer.vscode-eslint"
vscode "editorconfig.editorconfig"
vscode "esbenp.prettier-vscode"
vscode "expo.vscode-expo-tools"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.remotehub"
vscode "github.vscode-pull-request-github"
vscode "graphql.vscode-graphql"
vscode "graphql.vscode-graphql-syntax"
vscode "irongeek.vscode-env"
vscode "joshx.workspace-terminals"
vscode "kumar-harsh.graphql-for-vscode"
vscode "mattpocock.ts-error-translator"
vscode "mrmlnc.vscode-duplicate"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode-remote.vscode-remote-extensionpack"
vscode "ms-vscode.azure-repos"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-repositories"
vscode "ms-vscode.remote-server"
vscode "ms-windows-ai-studio.windows-ai-studio"
vscode "msjsdiag.vscode-react-native"
vscode "mylesmurphy.prettify-ts"
vscode "pflannery.vscode-versionlens"
vscode "prisma.prisma"
vscode "redhat.vscode-yaml"
vscode "rust-lang.rust-analyzer"
vscode "ryanolsonx.solarized"
vscode "streetsidesoftware.code-spell-checker"
vscode "tamasfe.even-better-toml"
vscode "unifiedjs.vscode-mdx"
vscode "waderyan.gitblame"
vscode "wayou.vscode-todo-highlight"
vscode "wilsonsio.color-vision"
vscode "wix.vscode-import-cost"
vscode "yoavbls.pretty-ts-errors"
{{ end }}
